/*
** EPITECH PROJECT, 2025
** help.c
** File description:
** This file contains all the help messages of the cod editor.
*/
#include "global.h"

int editor_help(void)
{
    printf("\n\033[36m╔════════════════════════════════════════════════════════════╗\033[0m\n");
    printf("\033[36m║\033[0m          \033[33m╔═══════════════════════════════════╗\033[0m             \033[36m║\033[0m\n");
    printf("\033[36m║\033[0m          \033[33m║\033[1;32m       COD - Text Editor v%s\033[0m\033[33m    ║\033[0m             \033[36m║\033[0m\n", VERSION);
    printf("\033[36m║\033[0m          \033[33m╚═══════════════════════════════════╝\033[0m            \033[36m ║\033[0m\n");
    printf("\033[36m╠════════════════════════════════════════════════════════════╣\033[0m\n");
    printf("\033[36m║\033[0m \033[1;35mUSAGE:\033[0m                                                    \033[36m ║\033[0m\n");
    printf("\033[36m║\033[0m   \033[32m./cod\033[0m                   Create a new file                \033[36m║\033[0m\n");
    printf("\033[36m║\033[0m   \033[32m./cod <filename>\033[0m       Open or create a file            \033[36m ║\033[0m\n");
    printf("\033[36m║\033[0m   \033[32m./cod --help\033[0m           Display this help message       \033[36m  ║\033[0m\n");
    printf("\033[36m║\033[0m   \033[32m./cod --version\033[0m        Show version information        \033[36m  ║\033[0m\n");
    printf("\033[36m╠════════════════════════════════════════════════════════════╣\033[0m\n");
    printf("\033[36m║\033[0m \033[1;35mKEYBINDS:\033[0m                                                \033[36m  ║\033[0m\n");
    printf("\033[36m║\033[0m   \033[34mCtrl + S\033[0m                Save the file                   \033[36m ║\033[0m\n");
    printf("\033[36m║\033[0m   \033[34mEsc\033[0m                    Quit the editor                 \033[36m  ║\033[0m\n");
    printf("\033[36m╠════════════════════════════════════════════════════════════╣\033[0m\n");
    printf("\033[36m║\033[0m \033[1;35mDESCRIPTION:\033[0m                                            \033[36m   ║\033[0m\n");
    printf("\033[36m║\033[0m   COD is my minimal code editor integred in the cmd        \033[36m║\033[0m\n");
    printf("\033[36m║\033[0m   directly. There are a few shortcuts alvailable and I     \033[36m║\033[0m\n");
    printf("\033[36m║\033[0m          will add more features later.                     \033[36m║\033[0m\n");
    printf("\033[36m╚════════════════════════════════════════════════════════════╝\033[0m\n\n");
}

int display_version_message()
{
    printf("------------------------\n");
    printf("Current version : \033[32m%s\033[0m\n", VERSION);
    printf("------------------------\n");
    return SUCCESS;
}
